my_list_odd = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
pref_sent_list = []
for i in my_list_odd:
    if i.replace("+", "").replace("-", "").isdigit():
        if i.isdigit():
            pref_sent_list.append(f"'{int(i):02}'")
        else:
            pref_sent_list.append(f"'{i[0]}{int(i[1:]):02}'")
    else:
        pref_sent_list.append(i)
print(pref_sent_list)

# Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
# (добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух целочисленных разрядов:
# ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
# Сформировать из обработанного списка строку:
# в "05" часов "17" минут температура воздуха была "+05" градусов
# Подумать, какое условие записать, чтобы выявить числа среди элементов списка? Как модифицировать это условие для чисел со знаком?
# Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже. Главное: дополнить числа до двух разрядов нулём!